[
  {
    "property_name": "Cumberland",
    "date_acquired": "1/13/2020",
    "original_investment_thesis": "We bought this center from Rural King at a very fair cap rate. We knew it was a good Big Lots store and they had recently invested $600 to $800K renovating it. We knew they would renew their lease. It was attractively priced due to the shorter term nature of their lease.  It is a great location in Crossville and the Rural King drives a ton of traffic. It was a great buy on the price per pound ratio. We did not know if it was going to be a long term hold when we bought it, but we have decided to hold it as we have a very low interest rate CDFI loan and the cash flow is great on it.",
    "owners_intent_10yr": "For now, our plan is to continue to hold this shopping center. We have a great interest rate on it, but that will reset later this year. The good news is the Fed has dropped rates, and we can probably have a rate in the mid to low 4% range when we reset for 2027. Now that we have Ollie's in the Big Lots, that has removed a lot of the pressure from this property. We could sell it and make a decent return, but I believe in Crossville long term, as there are not many good shopping centers there and we are at the main intersection of that town. Also, Rural King is a great neighbor and drives significant traffic. Shout out to the property managers for pushing the rents on the other tenants.",
    "general_notes": "•We own a portion of the shopping center and Rural King owns their parcel and portion. We have an REA agreement in place with them.\n•Bargain Beds went out of business in 2024, but the space was backfilled quickly by Benny's.\n•Big Lots went out of business in 2025, but we were able to get a deal done with Ollies to take the space at a higher rate than Big Lots was paying. It was not a cheap deal (costs us about 700-800k), but it added long term value to the center if we wanted to flip it. \n•Avalon Center is gross. \n•We renewed EZ Rental and switched them to NNN instead of a  flat $150.00 for additional rent. (New expiration 12/31/27) \n•We renewed Avalon in 2024 and bumped their rent 40% to be closer to market. They expire on 07/31/27. \n•Had mainline sewer work completed in 2022 costing $6,432.05. Fed directly to EZ Rental Plumbing which is how we found the issue. More sewer work in 2024 that cost $5,759.61 on the main that fed into Avalon. $7k in sewer work completed for Ollie's delivery. \n•Second Chance (Avalon) recently has had multiple roof leaks as of Dec 2022 and 3 in 2023. No leaks in 2024. The roof over that portion of the building is something to look out for. \n•We will have to Sealcoat and Stripe Ollie's for their grand opening per the lease.",
    "occupancy_rate": "100%",
    "market_psf_rate": "$12-14",
    "avg_psf_rate": "$5.28+1.50",
    "leasing_strategy": "No vacancies currently. We will need to keep an eye on Bennys with Ollies moving in and the issues that could come up. We sit in a good location in that market and should not have a problem leasing space long-term",
    "vacancies": "N/A",
    "tenant_mix": "We have decent tenant mix here - Avalon Center is a thrift store non-profit, Bennys and Ollies will be similar (hopefully feeding off one another)",
    "renewals": "Avalon Center 7/31/2027\nEZ Rental 12/31/2027\nBenny's 12/31/2029 with a 5 year option",
    "risks": "Bennys being next to Ollies",
    "capex_budget": {
      "2024": "$13,951",
      "2025": "$215,897",
      "2026": "$312,793",
      "2027": "$395,000",
      "2028": "$20,000",
      "2030": "$275,000"
    },
    "capex_outlook_summary": "Potential roof replacement 2027\nPlumbing is an issue here - Cast Iron and old. We need to plan for this.\nLED replacement for lights - do them as they come up.",
    "long_term_items": "Roofs and Plumbing"
  },
  {
    "property_name": "Eighth",
    "date_acquired": "4/12/2018",
    "original_investment_thesis": "We bought this property due to the long term value creation opportunities on 8th avenue and the fact it was a great price for an acre of land. A broker brought us the deal with Enterprise in tow to lease the property. It has been a great investment so far as many people have upgraded the properties all around us.  The property should continue to gain value.",
    "owners_intent_10yr": "Our plan is to lease it to Enterprise as long as they keep renewing.  Once their lease is up, we will either greatly increase the rental amount or we will redevelop the site. We have no intentions on selling it.",
    "general_notes": "• Enterprise occupies all .75 acres on a ground lease.\n• We pay a quarterly stormwater bill that is billed back to the tenant. Tenant is responsible for all utilities, however, the stormwater must remain in the land owners' name according the metro water.\n• They renewed their lease until 10/31/2028.\n• Enterprise pays annual reconcilation for taxes.\n• They have 2 five year options remaining. Year 11-15 at $16,500 a month. Year 16-20 Needs to be renegotiated, but it shall not exceed 5% over rent in third term.",
    "occupancy_rate": "100%",
    "avg_psf_rate": "$96 + $19.72",
    "vacancies": "N/A",
    "renewals": "Enterprise will expire 10/31/2028.",
    "risks": "N/A",
    "capex_budget": {
      "2023": "$19,200",
      "2028": "$19,200"
    },
    "long_term_items": "- When the Enterprise lease expires, we will probably want to sell this property or repurpose it."
  },
  {
    "property_name": "Evansville",
    "date_acquired": "8/17/2022",
    "original_investment_thesis": "A fair-market buy & hold deal. We acquired a 100% leased shopping center at a fair price point. The Big Lots store is a strong performer, and the Ruler Foods offers another strong credit tenant with their Kroger guaranty. The market has a strong blue-collar population that will support discount retail operations, and there’s strong traffic and visibility. There’s upside in the future through rent growth, debt pay down, and an outparcel where the city bus stop is and the Pearl Embroidery.",
    "owners_intent_10yr": "Our hope is to get the Big Lots leased in 2026 and then cash flow the property. We would have a hard time making money if we sold it, so we'll hold it as a coupon clipper once we get that one leased. We will also redevelop the bus stop out parcel when their lease expires. As that will be a good value creation play for us.",
    "general_notes": "• Overall, this center is solid and does not cause many issues. We have a very good maintenance team who takes care of everything and are very responsive.\n• In 2023 and 2025, we had to have some big parking lot light work done that was unexpected due to wires going bad under the ground connecting poles. \n• The Barton's home outlet HVAC units (60 and 15 ton units) were replaced in 2024. \n• Spirit occupied the BL box when they went out of business and vacated their space. \n• Big Lots installed new HVAC units in the Spring of 2024 which cost between $250k and $300k. We provided them with $100k per their renewal amendment.\n• There have been issues with the foundation at the Home outlet and Ruler Foods with the concrete/subfloor which is LL's responsibility. I have only had to make repairs one time, but it is a potential item in the future to be an expense. This was an old target where they had pipes running underground to cool their refrigeration, so when the home outlet uses their big heavy forklifts it damages the concrete. \n• Pearl Embroidery's roof is in very bad shape, but we are just limping it along and not going to do a replacement. We might redevelop that parcel.\n• We spoke with the City of Evansville for the bus stop and they are not willing to do a buy out as this is a very important stop for their routes. They asked if we would sell it to them.",
    "occupancy_rate": "54%",
    "market_psf_rate": "$5-6",
    "avg_psf_rate": "$4.52 + $2.11",
    "leasing_strategy": "Big Lots interest:\n-Trampoline Group reached out\n-Amusement type use\n-Pickleball Kingdom\n-MAC BID",
    "vacancies": "Big Lots - 37,320",
    "tenant_mix": "We have a decent tenant mix with a grocer - Ruler Foods, Ice house, Embroidery Store, and Bartons Home Outlet. We also receive additional income from the bank and the bus stop.",
    "renewals": "Ruler Foods renewed in 2023 which was a huge win. They unfortunately backed off of another renewal extension we were working on with them. Pearl may leave as he has not signed his renewal yet.",
    "risks": "Home Outlet and Ruler Foods both expire in 2028.",
    "capex_budget": {
      "2023": "$38,700",
      "2024": "$110,868",
      "2025": "$208,895",
      "2026": "$490,000",
      "2027": "$80,000",
      "2028": "$328,000"
    },
    "capex_outlook_summary": "In 2023, we had to spend $27k on the parking lot lights due to the wiring underground being very old. They were not built properly which led to them having to excavate the concrete to get into the junction box. We also bought and installed new HVAC units for Bartons for $110k. We need to plan for having to do a partial tear off on this roof. We also need to be aware of the parking lot light issues that are persistant here.",
    "long_term_items": "- One strategy is to do an outparcel where the bus stop is currently located. \n- We also may want to let Pearl Embroidery's lease expire and tear it down to do a new outparcel as that building is very old and not the best type."
  },
  {
    "property_name": "Fessey",
    "date_acquired": "9/17/2015",
    "original_investment_thesis": "We bought this building due to the low basis and the great in-town location. We thought we would be able to convert it into a cool creative office building and still keep the rent relatively affordable.  We were able to do that. We are now on our 2nd generation of tenants and it has proven to be a great investment",
    "owners_intent_10yr": "Our plan is to hold this asset. We have a great long-term lease with Spring Automation and the lease includes annual rent bumps so the cash flow will grow each year. We have a great loan on it with an attractive interest rate (low 5% range) through 2028.  We might refinance this one next year after the Fed hopefully drops rates a little so we can bring down the 5.35% interest rate.",
    "general_notes": "• Fessey is a great property overall. It produces solid cash flow and is comfortably fully leased for the next 4 years.\n• This building is in overall good shape, it is an older industrial-style building with loading docks and rolling doors. The main issue is the HVAC/roof leak that has been persistent historically.\n• We have one tenant, Spring Automation, who is a good tenant and pays rent on time every month. \n• 11,293 Sqft total.\n• The owner has said that they are planning to move forward to converting this to a Harbor + Union, but they are still working on plans and everything. As of now, they said to not plan to budget any TI payments for them.",
    "occupancy_rate": "100%",
    "avg_psf_rate": "$24.69 + 5.00",
    "vacancies": "N/A",
    "tenant_mix": "We have one tenant, Spring Automation, who occupies the entire building.",
    "renewals": "Spring Automation expires 2/28/2030.",
    "risks": "Having only one tenant, is a risk in and of itself if they were to go out of business. We believe that is highly unlikely due to their success and financial backing.",
    "capex_budget": {
      "2023": "$72,881",
      "2025": "$2,500",
      "2026": "$15,000",
      "2027": "$5,000",
      "2028": "$15,000",
      "2030": "$60,000",
      "2032": "$200,000"
    },
    "capex_outlook_summary": "The only capital item we are monitoring is the parking lot drive way on the right side of the building that was paved over railroad tracks.",
    "long_term_items": "- Potentially would like to run a gutter under the concrete that is near the garage door. However, the concrete may not hold up well enough. \n- Touchup the metal legacy sign part."
  },
  {
    "property_name": "Gastonia",
    "date_acquired": "12/9/2022",
    "original_investment_thesis": "A value-add and future play. We’re bullish on Gastonia over the long-run, and this is the primary retail center on the West side of the market at an attractive price. Strong existing anchors of Big Lots, Family Dollar, Aaron’s, and a Mexican Grocery provide sufficient operating margin and allow us to conduct value-add leasing, renovations, and out-parcel redevelopment over the long-run. Significant residential growth is planned around the center and this will improve our ability to attract higher quality tenants and foot traffic.",
    "owners_intent_10yr": "Continue adding value to the Shopping Center via Leasing efforts and redeveloping the out-parcels/frontage of the Center. As these improvements are made, and Gastonia grows simultaneously, the property will transition into a long-term hold asset that generates steady cash flows. We plan to hold this one long term, as Gastonia will only get better through the years. We need to let some of these bad leases, like WOW Supermarket, burn off so we can do market rate deals.  We also might refinance the center in 2026 to bring our rate down as we could beat that rate right now.",
    "general_notes": "• Dixie Village has improved significantly since we purchased this shopping center. We have seen a lot of interest in new tenants moving into our center on the leasing front due to improvements and overall momentum. Dollar General put about $150k and Jackson Hewitt put $10k into their space in 2023. \n• We are excited to have some major parking lot repairs made along with some striping to really increase the overall appearance of the center. We also had the facade painted and the side of Big Lots in 2024 which made a huge difference. \n• A huge win was to get Crazy Bargain Deals open for business and paying rent. (21k SF)\n• We successfully replaced the VV/Club roof and the Big Lots roof in 2024. The only two that need replacing is the Laundromat building and Gavel Time  roof.\n• The Value Village and Hair Depot HVAC units have been replaced recently. We recently replaced CBDs units that were 50 years old.\n• Family Dollar is expiring at the end of 2025, we will want to get them renewed. They have a 5 year option in their lease with fixed rent amounts.\n• Gastonia Environmental issue with the Cricket where a cleaners use to be located. We will have to pay a fee or work with a company when we redevelop the outparcels. \n• The bus stop is now dormant and it the busess no longer run through our parking lot.",
    "occupancy_rate": "92.73%",
    "market_psf_rate": "$16-20",
    "avg_psf_rate": "$4.78+ $1.54",
    "leasing_strategy": "Lots of potential here.\nIdeal tenants: nail salon, gym, hardware stores, restaurants.\nWe also have plans for multiple outparcels.\n\nBig Lots interest\n-Ross LOI\n-Ollies expressed interest in the past\n-Pickleball Kingdom\n-early stages with O'Reilly broker for hub store",
    "vacancies": "2545 - 1,875\n2547A - 3,600\n\nLower Building:\n2577 - 800\n2579 - 3,400\n2591 - 1,200\n2593 - 2,250 (laundromat)\n\nAll vacant suites will need some work or TI",
    "tenant_mix": "We have a great mixture of tenants including national tenants such as Family Dollar, Aarons, and Big Lots. We also have restaurants, service, and other smaller retail stores.",
    "renewals": "Value Village - 11/21/26",
    "risks": "Big Lots is vacant",
    "capex_budget": {
      "2023": "$595,919",
      "2024": "$690,932",
      "2025": "$319,038",
      "2026": "$580,693",
      "2027": "$75,000",
      "2030": "$94,000",
      "2033": "$265,000"
    },
    "capex_outlook_summary": "We only have two more roofs that needs replacing. The parking lot is massive and is not in the best shape, we are planning to spend $50k a year to repave chunks at a time.  We have had to spend money on plumbing as it is old here and that has come up often at this property.",
    "long_term_items": "Small building Roof needs replacing (Smalmart, laundromat)\nArchitect to draw up renderings for a major facelift change to the center \nTear down out parcels - Ace, Winners, Boost, Car Wash, and Gavel Time.\nRedo the plumbing to fix constant issues in Great Wall and Boost Mobile."
  },
  {
    "property_name": "Hamilton",
    "date_acquired": "6/9/2023",
    "original_investment_thesis": "A tenant relationship play with future upside. We acquired the property at an attractive cap rate due to some non-material concerns with the center. The anchor tenant, Bargain Hunt, had a sales kick-out that we were able to waive prior to closing. Hamilton is a stable, blue-collar suburb of Cincinnati and the demographics align well with discount-retail focused centers. The primary retail node sits just North of our center, and all traffic must drive past the location to get to the other retailers. Future upside is possible through rent growth, and re-leasing the Variety Surplus store that’s paying a low gross rent.",
    "owners_intent_10yr": "Focus on leasing the Variety Surplus and other smaller vacancy at market rents. Once this occurs, the deal will provide strong cash flow and a good annual return to our investors. This will be a mid to long-term hold if we're able to execute our leasing strategy and have favorable financing in the future.  It is not a deal I would say we will for sure own long-term, but we might, depending on where the market cycle is and what kind of money we can make if we sold it. Hopefully we can get Dutch Brothers done, as that will be a huge win for the center.",
    "general_notes": "• This center is in good shape overall. We replaced the bad roofs on the left side in 2025.\n• We have a good tenant mix here with national tenants and mom-and-pop shops. Most tenants have been here for over 10 years. \n• We replaced the roof over the Autozone, Variety Surplus, US Nails, and Illuminaudi in 2024.\n• There have been talks with the city about purchasing the land behind the center. We only own up to the back of the building. We may need to install a dumpster enclosure if this purchase happens. \n• We were able to backfill the Bargain Hunt space with Mac. Bid.\n• Cincy Vapors and Variety Surplus vacated their spaces. The African Mart space was successfully leased to the Asian Market.\n• We need to keep an eye on Rent-A-Center who we had to reduce their rent at the last renewal.\n• Gold Star Chili renewal offer has been sent. They still haven't signed this yet. \n• Autozone was renewed and we got outparcel rights for the Dutch Bros. The purchase of the outparcel is currently under contract. They are set to close on March 26, 2026.\n• The parking lot was sealcoated and striped in 2025 to really increase the overall appearance of the center and to extend the life of the parking lot.",
    "occupancy_rate": "81.57%",
    "market_psf_rate": "$8-16",
    "avg_psf_rate": "$6.24 + $2.54",
    "leasing_strategy": "Fill the Variety Surplus space. Any retail. Pet stores, \nOutdoor stores, Bigger restaurants & clothing stores.",
    "vacancies": "103 - 12,744\n114 - 1,978",
    "tenant_mix": "Good core of national tenants and mom and pops. Bargain Hunt, AutoZone, Subway, Pizza Hut, Metro PCS, and Gold Star Chili.",
    "renewals": "Cricket is month to month. We are monitoring his success to see if his business turns around and if he can get approval to sign a renewal. \nMetro PCS - 7/31/26\nIlluminaudi - 3/31/26. Offer sent to him getting him up to $10 psf in 3 years",
    "risks": "The only tenant we are worried about is Cricket as they are on a MTM lease due to their store underperforming. If Illuminaudi leaves that will be a hard eblow space to backfill, but high confidence they will renew for 2-3 years.",
    "capex_budget": {
      "2024": "$284,867",
      "2025": "$407,174",
      "2026": "$293,490",
      "2027": "$10,000",
      "2028": "$20,000",
      "2029": "$10,000",
      "2034": "$250,000"
    },
    "capex_outlook_summary": "The roofs are all relatively new. We have had some plumbing issues historically. There are a few HVACs we may need to replace in the future. The parking lot it is in good condition especially with the recent sealcoat and stripe.",
    "long_term_items": "Build a new Dumpster Enclosure\nBuy land from the city behind the center\nAdd bollards around the hydrant in the rear\nThe back door at Metro PCS is old and needs to be replaced (Tenant responsibility)\nUpgrade Pylon sign\nDecks need to be repaired behind the center"
  },
  {
    "property_name": "Harrison",
    "date_acquired": "7/7/2017",
    "original_investment_thesis": "This was a deal that was brought to us by Big Lots. They had a successful store in a bad shopping center in town and they wanted to relocate it. Kmart had a couple years on their lease when we bought it, but we got a good price due to all of the known issues with Kmart and the fact they were paying 2 or 3 dollars psf in rent. Thus, we bought this on an attractive psf price.",
    "owners_intent_10yr": "Our current plan is to get the middle space leased (praying 2026 is the year as we have sat on this box forever) and then evaluate our options. Big Lots does well here, but Harbor Freight has not done well the last 12 months.  Harrison is a great market and will get better for years to come. It has great schools and people move here from Cincinnati due to quality of life, affordability and schools. Market should continue to get better over time.  Retailers all have told us they do good #s here. Not having WalMart in town helps.",
    "general_notes": "•We only own a portion of the shopping center which was formerly a K-Mart. We have divided the space into three sections consisting of Big Lots, a vacancy in the middle, and Harbor Freight at the end. \n•Parking Lot Lights $27,950.00 capitalized in 2022 to be expensed to the tenants over 5 years. \n•When Harbor Freight Lease was signed, it was discovered that Big Lots has 46,152 sq ft vs the 40,000 sq ft per the lease. \n•We built a new facade and entrace to the vacant suite in 2024. \n•We completed parking lot work in 2022 before HF opening for $ 7,659.00. This benefited the whole center and we passed through as recoverable. This was the remaining parking lot work needed as we did Big Lots portions prior to them opening for business.\n•The vacant space was originally thought to be 27,900 sqft but is actually 30,000sqft \n• There is a new brewery that opened next to us and we need to keep an eye on the parking situation there. Inspector is monitoring and working with tow company.\n• The main focus is on finding a tenant for the vacant suite.",
    "occupancy_rate": "63.53%",
    "market_psf_rate": "$10-11",
    "avg_psf_rate": "$6.32 +$1.89",
    "leasing_strategy": "Get the vacancy leased. Hard spot due to L shape and only 80 feet of frontage. Harrison is a good market overall, just have to find the right users",
    "vacancies": "Suite: B - 32,959\nNew facade, no rooms, no bathrooms, complete open space, sprinkler system in place, exit signs, and concrete floors.",
    "tenant_mix": "Great mix of corporate tenants - Big Lots & Harbor Freight. Finding a tenant & getting a waiver from BL & HF has proven to be a challenge.",
    "renewals": "N/A",
    "risks": "N/A",
    "capex_budget": {
      "2024": "$157,900",
      "2025": "$17,500",
      "2026": "$100,000",
      "2027": "$265,000",
      "2032": "$400,000"
    },
    "capex_outlook_summary": "Potential capital needs is the HVAC units on the vacant space, roof replacement over HF/vacancy and the store front that is needed for the vacant space. We also need to plan for a sealcoat and stripe in the next year or two.",
    "long_term_items": "Vacancy facade, roof over Harbor Freight/vacancy, TI money for potential tenant, and vacant HVAC work."
  },
  {
    "property_name": "Hickory Hollow",
    "date_acquired": "4/20/2016",
    "original_investment_thesis": "We bought this center at a great price from a large owner that had gotten a really good deal on a portfolio of assets. They did not want to keep this one and sold it to us at what they paid for it.  We had Bargain Hunt in tow for the large vacancy so it made the deal better for us. Part of the reason we got a good price is due to Bed Bath and Beyond being the other large tenant.  They had financial issues at the time. We felt good we could find a backfill for them when they went out and we leased it to Ashley Furniture. We eventually did a build to suit with Starbucks. This has been a great deal for us.",
    "owners_intent_10yr": "Due to how hard it is to buy deals in Nashville and how much better Antioch is getting, I do not see us selling this project. We have a very low rate CDFI loan on it (unfortunately that will reset later in 2026 but it still won't be terrible) and it is a cash flow machine.  The site is in the heart of Antioch and our rents have room to grow over time. Plus, Starbucks is a huge traffic generator and we have room to grow their rent over time. They are below market. This is a good asset for us and we are glad to own it.  The investors have received all of their money back plus a generous return so we do not feel the pressure of the IRR clock ticking on us. Adding Burlington was a huge win. They are out of options in seven years, and we can greatly jack up their rent at that point.",
    "general_notes": "• This center is in good shape overall. We have three solid Anchor tenants with a lot of term left on each lease. We are thankful Burlington puchased the lease at auction and spent hundreds of thousands of dollars into their space. It looks amazing and has brought great traffic to the center. \n• We had two big renewals in 2023 of Ashley and Bargain Hunt. \n• We have issues with homeless people behind the building and some that sleep under the awning on the left side.\n• Freeland Auto continues paying us $300 a month on a MTM basis for 17 parking spots. \n• The fence we built in the back has been cut a lots of times and cameras have been destroyed.\n• Bargain Hunt has old HVAC units and we had to replace 8 of them in 2024, thankfully Burlington replaced the two older ones that weren't working when they did their buildout. We replaced one of D&K units this year, but the other one is 23 years old.",
    "occupancy_rate": "100%",
    "market_psf_rate": "$19-23",
    "avg_psf_rate": "$9.35 + $2.97",
    "vacancies": "N/A",
    "tenant_mix": "Great tenant mix with D&K Menswear, Ashley's Furniture, Burlington, and Starbucks. Additional income from Freeland Chevrolet and Urbe Pizza food truck",
    "renewals": "DSG, D&K, and Burlington all expire in 2028.",
    "risks": "N/A",
    "capex_budget": {
      "2024": "$144,220",
      "2025": "$104,736",
      "2026": "$63,184"
    },
    "capex_outlook_summary": "In 2020 the Roof was replaced and the parking lot lights were converted to LED. 8 of the Bargain Hunt HVACs are brand new as of 2024. 2 are new as of 2025.",
    "long_term_items": "Potential Pylon Sign upgrade with new panels. \nNew Sign for Burlington and Ashley by the road in front of Starbucks. \nChanging the left side of Burlington."
  },
  {
    "property_name": "Highland",
    "date_acquired": "12/31/2014",
    "original_investment_thesis": "We bought this asset from a bank at a very low price due to foreclosure. Office Depot was the anchor tenant and they were in financial trouble and did not have much term left on their lease, which they were trying to get out of.  We had Bargain Hunt lined up to do a lease on the space, but got hosed on it due to Office Depot not terminating in time and Bargain Hunt having to renew in their current location. It took us a couple of years to lease it, but we eventually found American Freight. Due to our low basis, it is a great cash flow asset when leased, but we do not want it to be vacant due to how hard it was to lease.",
    "owners_intent_10yr": "Thankful to get the MACBids deal done, as that's been a huge boost to cash flow, and they are paying better rent than American Freight was. Hopeful they'll renew in a couple years, as they only did a three-year lease. We have been told it is not their best store, but hopefully it's good enough to renew.  We need to get the other space leased. If we can get MACBids renewed and get the other space leased, we will probably sell this center",
    "general_notes": "•We unfortunately lost two tenants at this center in 2024 due to them both going out of business.\n•Thankfully, we signed a lease with Macbid to take the vacant American Freight space. They have struggling with their reviews and management, but still seem to be doing okay as they pay rent each month.\n•We have had no luck in engaging our attorney to try and collect amounts owed to us from Mo Bins and the 3 guarantors on that lease. \n•Autozone took over the former Toys R Us space. They own their portion of the building and pay us CAM. REA agreement with Autozone is where the lease requirements can be found. \n•We have a food truck that is in the parking lot of this location and they pay $200.00/mo Josue Rosas- Food Truck.\n•On the other side of Macbid there is a piece of land that is owned and not developed by a different real estate company. They also own the parking lot that sits in front of their side. No parking lot lights are on in this portion. In 2022 we installed one LED on their side of the parking lot due to how dark it was with their lights not on. They refuse to turn the parking lot lights on since they do not have anything on that land.",
    "occupancy_rate": "80%",
    "market_psf_rate": "$9-12",
    "avg_psf_rate": "$7.25 + $1.94",
    "leasing_strategy": "Get Mega Deals leased. We have interest from the nail operator in Millington. It sat for a while before Mega Deals went there. Need to highlight the new development next door and capitalize off of the increased traffic from Mac Bid.",
    "vacancies": "Mega Deals - 7,396",
    "tenant_mix": "Mac Bid\nAutoZone owns their parcel",
    "renewals": "Mac Bid expires 8/31/28",
    "risks": "Mac Bid is only on a 3 year lease. They have 2 5-year options and we would love for them to stay because this is a hard box to lease",
    "capex_budget": {
      "2025": "$276,464",
      "2026": "$155,000",
      "2027": "$65,000",
      "2028": "$233,502"
    },
    "capex_outlook_summary": "The Macbid Units are from 1998 and we will need to replace them in the near future. We did repairs when we delivered the space to buy time since we spent a lot on TI and LL work.  \nWe need to keep a close eye on the roof above MO bins - it will need to be replaced in the decently near future."
  },
  {
    "property_name": "Johnson",
    "date_acquired": "5/25/2018",
    "original_investment_thesis": "We were brought this deal by a broker that had a relationship with the former owners. They wanted to do a sell lease back due to them needing cash. They sold to us at an attractive cap rate based on a below market rent, so our basis in the property was good. They secured the lease with a family farm they owned so we were not worried about their bad financial condition.  We thought we could grow the rents over time which has proved to be true. There will not be anymore industrial properties zoned in Nolensville over time so we felt good about owning it knowing that some segment of Williamson County business owners would want to put their business by where they live",
    "owners_intent_10yr": "We are hoping and praying that Wildcard closes by the end of April, which is the contract date they have to close. If they do not, they lose $150,000. I have recently spoken to the owner, and he said they are definitely going to close. He is working on their loan now. I'm hopeful he can get it to the finish line, as it would be a huge win for our investors",
    "general_notes": "• This industrial building is in decent shape overall except for the metal roof that has been coated. \n• Wild Card has the option to purchase the building for a set price but must close by 4/30/26. This is very likely to happen.\n• Wildcard painted the building exterior, which made a big difference and added another loading dock door. \n• Millcreek is doing well, along with Wildcard, at getting their rent in on time.\n• We renewed Millcreek for 5 years at their option rates. \n• There have been some lingering roof leaks that have had to be addressed in the Wild Card Space. $7k in annual roof maintenance. \n• We are only responsible for the parking lot maintenance on the Wildcard side. Not the Millcreek side.",
    "occupancy_rate": "100%",
    "market_psf_rate": "$6-9",
    "avg_psf_rate": "$6.86 + $1.27",
    "vacancies": "N/A",
    "tenant_mix": "Good tenant mix for the positioning of this property with Mill Creek and Wild Card.",
    "renewals": "We successfully renewed Millcreek",
    "risks": "N/A",
    "capex_budget": {
      "2023": "$27,110",
      "2024": "$7,500",
      "2025": "$28,022",
      "2027": "$564,000"
    },
    "capex_outlook_summary": "We extended the life of the roof by doing maintenance with Maxwell for $7,205. We are going to continue the limp along the roof until we figure out if the sale is going to be final or not. We have one pretty good report from Davco that they did in 2024 if we have to show something to the buyers during their DD. It is hard for any roofer to confidently say the lifespan of this roof.",
    "long_term_items": "• Potential outparcel lease.\n• Wild Card could potentially purchase the property in 2026."
  },
  {
    "property_name": "Lebanon",
    "date_acquired": "5/28/2015",
    "original_investment_thesis": "We bought this due to it being super cheap and super rough when we bought it. It had a shady old motel on it that was out of business. This was on half of the property. The other half was the buildings that house R1 now and Eagle's Nest, which was there when we bought it and pay super low rent. We did a ground lease with Enterprise and they spent a couple million dollars building their store. The ground lease is cheap and it would be great if they left one day as we could rent the building for a lot more than their ground lease. This has proven to be a great deal for us and that street continues to get better each year. They are building a really nice 300 unit apartment complex behind us that will only increase the value of our property.",
    "owners_intent_10yr": "Our plan is to hold on to this deal for the foreseeable future. It has huge redevelopment opportunities for half of the site (R1 and Eagle's Nest) and the street is getting more and more valuable over time with all of the redevelopment.  If Enterprise does not renew their lease, we will be able to rent their building for substantially more than the current ground lease they pay. I am bullish on this site longterm.",
    "general_notes": "•This property is very simple. The tenants take care of everything here other than the roof.\n•Eagle Nest was talking about being sold to the biggest coach company that have repaved parts of the property to house their 10 busses. Transaction was supposed to happen in 2025. Mark will remain there running the operations as he is the main mechanic. \n•Eagles Nest pays 50% of the property taxes bill and they are 40% of the pro rata share. \n•EAN- Holdings Enterprise (net lease) we only pay ½ of property taxes. They do all payments, utilities, and landscaping. \n•Only tenant that pays true CAM is Eagle Nest. \n•R1 Towing pays pays $10,500 each quarter. \n• We have a Billboard on the property that we have lease to Lamar. \n•In 2022 we were completing quarterly jetting for Eagle Nest until we discovered that due to old pipes and extensive work that would have to be done on their lines, the jetting was not doing anything to help their plumbing. We stopped the contract on the jetting and Mark has agreed to live without using his bathrooms due to the amount of extensive work that would have to happen within the parking lot and the potential redevelopment of the property should he choose to retire officially. We recieved a bid for in 2023 in for plumbing work for $10k to complete plumbing work. \n•Besides the plumbing and potential parking lot repairs to the Eagle Nest portion of the property, the property is in good condition.",
    "occupancy_rate": "100%",
    "market_psf_rate": "$17-24",
    "avg_psf_rate": "$23.66 + $3.36",
    "vacancies": "N/A",
    "tenant_mix": "Great income for the mix of tenants we have here. Additional income from Enterprise on a ground lease and Lamar sign company.",
    "renewals": "Enterprise 7/31/26. \nEagle Nest is MTM.",
    "risks": "Eagle Nest - Potentially retiring",
    "capex_budget": {
      "2025": "$11,526",
      "2026": "$10,000"
    },
    "capex_outlook_summary": "The only capex item completed recently was the roof for the towing building in 2018. Potential cap ex-items include the plumbing work, parking lot work, and roof repairs.",
    "long_term_items": "Potentially clear out the front and back building. With the new development of large apartments next door, this property could potentially sell for a decent price."
  },
  {
    "property_name": "Madison",
    "date_acquired": "9/29/2017",
    "original_investment_thesis": "We bought this site due to it being 15 acres in the middle of Nashville at a great basis. We bought it at a very attractive per sf value and a great per acre land value. This gave us a lot of optionality on what we could do with the site long term. This project has had a lot of twists and turns, but has ended up being a great project with great tenants. It should continue to gain in value long term.",
    "owners_intent_10yr": "Our plan to hold this site long term. It is a great site in Nashville and will continue to get more valuable as the rents in East Nashville grow and Madison gets more desirable, which is happening. We have lined up some great tenants and I am bullish on it long term. We also have the opportunity to add more retail and also to add some buildings behind the center.",
    "general_notes": "•Main building tenants include Eastside Bowl and TruFit. \n•Makerspace Tenants include Sessions Hair, Passage Kava Lounge, Zoom Room, and Muse Dance.\n•Outparcel tenants include Shotgun Willies, Daddy's Dogs, and Vega Hospitality, LLC.\n•Eastside Bowl struggles to make timely payments and we have had to get our attorneys involved in 2024.\n•We cleared the woods behind the center in a couple of times over the years. We will eventually develop this part of our property and it has proven to eliminate almost all of the issues in this area. \n•We had to do drainage work behind the outparcel to install a commericial drainage system.\n•The budget for this property is different than most as it is separated by the main building, outparcel, and maker space. These sections have different invoices and different buckets of the budget.\n•Main building shares water and sewer. It was too expensive to separate out the water for the building and they would have had to dig up the parking lot so we decided just to bill the tenants quarterly for their usage for Eastside Bowl and TruFit.\n•Makerspace tenants only have gas in their name. Water and Electricity are included in Session Hair rent but it is included in all other Makerspace tenants CTI.\n•Outparcel will have to be billed separately as well or we can install a wifi-meter for 9K for the three spaces. \n•We will need to install a dumpster enclosure at some point for the outparcel tenants.",
    "occupancy_rate": "100%",
    "market_psf_rate": "$18-22",
    "avg_psf_rate": "$12.11 + $3.88",
    "vacancies": "N/A",
    "tenant_mix": "We've built a great mix of tenants at Madison. Anchored by Trufit and Eastside Bowl this center will become a destination retail. Our ouparcel is filled with some of the best local restaurants including Daddy's Dogs and Shotgun Willies.",
    "renewals": "N/A",
    "risks": "Passage Cava seems to be on their way to going out of business\nEastside Bowl has struggled to make timely payments.",
    "capex_budget": {
      "2024": "$472,263",
      "2025": "$202,681",
      "2026": "$47,500"
    },
    "capex_outlook_summary": "We have done an extensive amount of capital repairs at this property. During the redevelopment of this property, we had draw money from our loan that we used for these large items. The whole center has been updated and replaced from the roof to the parking lot, parking lot lights, and tenants have updated their HVAC units. \nOne concern: Keeping an eye on the parking lot lights. These have casued issues historically.",
    "long_term_items": "Industrial Park (cool metal buildings behind the center) and potential development over on the side of the parking lot closest to Walton Lane."
  },
  {
    "property_name": "Malone",
    "date_acquired": "5/19/2022",
    "original_investment_thesis": "A renovation and value-add deal. Big Lots’ interest in the market was the genesis for pursuing the Shopping Center. We benefitted from Running’s as an adjacent anchor, and JoAnn Fabrics and Label Shopper co-anchoring our portion. The Big Lots’ deal makes the investment breakeven, and then leasing activity on the remaining 31,750 sqft. is upside. While Malone is a small rural market, it serves as the county seat and has a sufficient population to support this retail center given the lack of other retail in the market.",
    "owners_intent_10yr": "Focus on leasing the remaining small shops and prepare to backfill the (potential) JoAnn's vacancy. Once additional leasing is completed, we need to evaluate the economics and decide if we hold vs take it to market. Our feeling about Big Lots' viability as a company will factor into our decision.",
    "general_notes": "• This shopping center has had a lot of capital work since we first purchased it with a new roof, sewer work, parking lot repairs, and vacant suite cleanouts.\n• 2025 was a tough year with both JOANN, Big Lots, and Malone Convenience moving out of the plaza. We are hopeful that we can get a few national tenants to move into the plaza in 2026.\n• We also spend a large amount of money each winter season on snow removal. We were able to decrease the expense this winter season by lowering the scope. \n• #1 Chinese restaurant and Label Shopper seem to be doing well and are consistent tenants.\n• There have been a couple of sinkholes at the property in the drive aisle/entrance way. We are planning to repave a good portion of the main drive aisle in 2026. \n• Pretty much all the vacant suites need new HVACs, and they need FLS work as well to get them sprinkled.",
    "occupancy_rate": "15.94%",
    "market_psf_rate": "$12-15",
    "avg_psf_rate": "$5.26 + $2.37",
    "leasing_strategy": "Any retail. Restaurants, Gym, Salon, Liquor Store. Need to do a deal to get some momentum and stir activity\n\nBig Lots interest\nOllies\nTJX +Five Below\nCrunch",
    "vacancies": "3 - 2,351\n5 - 4,070\n7 - 7,949\n8 - 2,972\n9 - 2,523\n10 - 1,799\n11 - 7,071\nBig Lots - 38,773\nAll suites are in need of significant work - electric, plumbing, mold, etc.",
    "tenant_mix": "Not a great tenant mix due to the lack of tenants. Not very much traffic is generated at the plaza.",
    "renewals": "Label Shoppers expires 10/31/2027.",
    "risks": "Losing Label shopper or #1 Chinese would be devistating",
    "capex_budget": {
      "2023": "$1,039,312",
      "2024": "$157,567",
      "2025": "$305,122",
      "2026": "$2,101,514",
      "2027": "$25,000"
    },
    "capex_outlook_summary": "The roof was replaced in 2022. The main capital items will be HVAC units for vacant units when spaces are leased.  The Parking lot needs repairs/maintenance each year due to the incredibly cold conditions in Malone.",
    "long_term_items": "The Propoane we will want to be switched to gas long term. \nLabel Shoppers has mentioned potentially expanding at some point."
  },
  {
    "property_name": "Maple Row",
    "date_acquired": "8/28/2014",
    "original_investment_thesis": "We tried to buy this center for a couple years and finally got it bought. It was bought from a shopping center developer that was older. We convinced him he didnt want to deal with the headache post GFC and he sold to us.  The price was right due to the Kmart being vacant. We sold that box to Kroger and this project has been a home run. We sold off some outparcels and redeveloped the portion of the center we still own today.",
    "owners_intent_10yr": "Our plan is to continue to own this center. Our basis is great and our loan balance is low relative to the value. If rates drop 1 or 2% from where they are today, we will refinance the center and put some longer term debt on it. Centers like this in Nashville are hard to find so we do not have an interest in selling it.",
    "general_notes": "• The center is in great shape overall and has a great tenant mix.\n• Flavors of India successfully opened this past year! They are even looking to expand into the Henersonville Nutrition space when they expire. \n• On the roof over Paul Mitchell, we need to keep an eye on the coating that was done in 2017 by ACS through Momentive. We have had multiple roof leaks but had preventative maintenance done in 2024. We also had this roof scanned and it was in decent shape and not saturated all over. We did not have near as many issues in 2025.\n• We have had multiple occurrences of the main line plumbing failing on the right side of the center. We have set up quarterly jetting to ensure that this does not get stopped up anymore. We are also researching potential liners to install to prevent this from happening.\n• We continue to monitor the Paul Mitchell students parking closely. We put them in default once in 2023 and towed an employee. In 2024 and 2025, we did not have issues.\n• Dance Hendersonville and From the Art Studio are struggling. FTAS will vacate, and Mick continues to be late on rent.\n• Note that a part of the facade fell on a car, so we need to continue to monitor that to make sure there are no safety hazards.",
    "occupancy_rate": "100%",
    "market_psf_rate": "$25-30",
    "avg_psf_rate": "$19.15 + $4.26",
    "vacancies": "None currently.",
    "tenant_mix": "Good tenant mix with a mixture of corporate and local tenants. Restaurants, nail salon, barbershop, etc. This is the ideal tenant mix. The only issue is that we are in violation of Petsmarts lease due to having a school.",
    "renewals": "FTAS 2/28/26 \nHendersonville Nutrition 10/31/26\nFox's Pizza MTM",
    "risks": "Dance Hendersonville has struggled to pay rent. \nFTAS is going to vacate, and Fox's Pizza is MTM. \nHendersonville Nutrition may leave when their lease expires.",
    "capex_budget": {
      "2024": "$41,345",
      "2025": "$6,000",
      "2026": "$195,142",
      "2027": "$320,000",
      "2030": "$350,000"
    },
    "capex_outlook_summary": "There is a plumbing issue below the tenants on the right side of the building that has caused lots of problems. We put a quarterly jetting contract in place in 2024. The main line is old and is causing the pipes to back up. Liner quote is around $32k. We need to also plan for a potential reroof above Paul Mitchell due to the Momentive roof.",
    "long_term_items": "Extending Indian Lake pylon sign down to add electronic sign. \nPaul Mitchell Momentive Roof\nPlumbing Issues on the right side of the center\nPaul Mitchell Parking Situation"
  },
  {
    "property_name": "Meridian",
    "date_acquired": "3/13/2014",
    "original_investment_thesis": "We were brought this deal through a broker in Jackson that we have done a lot of business with. He had a client that had it under contract but could not get it financed.  We partnered with him in a 50/50 partnership and it has been good. The broker had a tenant in tow so it was leased the day we bought it. The building had been foreclosed on so we got it at a great basis.",
    "owners_intent_10yr": "For now, our plan is to keep the current tenant there and hope she pays rent each month. She has been hit or miss the whole time as she is thinly capitalized. She says she wants to purchase the building, but I am not sure how she would ever pull that off. We are not opposed to selling to her for the right price. In the interim, we will keep collecting rent for her and staying in close contact with her to make sure she has the ability to pay.",
    "general_notes": "• D.A.Y College is the only tenant within this building. \n• Tenant is responsible for all maintenance requests at this property.\n• However, the soffit and roof both need major repairs, which is ultimately our problem as this will hurt the buildings value long term.\n• D.A.Y College struggles to send in their monthly rent promptly within the month that it is due or a month after it is due. They have to wait on money grants from the government and their income depends on their enrollment. \n• Elliott has become the new point person to communicate with DAY. He was trying to get her to set up ACH as well, and recently signed a renewal with her.\n• This is a modified net lease - they pay everything exclusive to taxes and insurance.\n• Tenant informed PM in 2023 that they were opening up another business in Paris, TN.",
    "occupancy_rate": "100%",
    "market_psf_rate": "$20-25",
    "avg_psf_rate": "$8.31",
    "leasing_strategy": "Keep looking for replacement tenant for DAY",
    "vacancies": "Available - 14,072",
    "renewals": "Renewed DAY for 3 years to now expire in 2028. The monthly rent increased to $12,833.33",
    "risks": "D.A.Y. College is on a payment plan but more often or not they are late or miss deadlines.",
    "capex_budget": {
      "2023": "$17,600",
      "2026": "$85,000"
    },
    "capex_outlook_summary": "No previous capital item expenses. The main capital expense that needs to be on our radar is the roof. Weather damage to the roof could potentially cause a need for replacement and to work with an insurance company to complete this.",
    "long_term_items": "Roof and tenant struggling with payments and outstanding balances."
  },
  {
    "property_name": "Millington",
    "date_acquired": "2/20/2019",
    "original_investment_thesis": "This property was for sale off-market through a broker in Memphis that we have a relationship with.  It was a good price per pound. We had Gimme A 5 in tow and plugged them into the vacancy. We also saw the opportunity to grow below market rents over time and get some of the small shops leased.  This is a great shopping center in the middle of Millington and it's perfect for our investment thesis.",
    "owners_intent_10yr": "We believe there is more value to be added on this center over time (develop a small outparcel, raise the rents, upgrade A-Stock, etc), so our plan is to hold the center for now and keep working our plan.  We had a solid set of anchor tenants. I am hopeful we can find someone for the vacancy that is a good fit.",
    "general_notes": "• We have a great tenant mix at this property.\n• In 2023 Dirt Cheap went out of business and Ollie's took over their space. Ollie's did a great job on their buildout and this has been a great upgrade for the center. This also is a great corporate contact for us to have for other shopping center large vacancies.\n• This center was struck by lightning twice now. We have put in preventative measures now with rods on the building to hopefully prevent this from affecting our building again. When it struck our building the first time in 2022 it affected our parking lot and the fire panel. When it struck a second time it affected our fire panel and some of the HVAC systems. \n• Tractor Supply upgraded their garden center at the end of 2023 and they invested a lot of money in their store to do this. This location does well for them and will be great when leveraging renewals for this store.\n• Keevado was replaced with A-Stock this year.\n• We had to replace the roof over Aarons and Esabelle Nails due to Momentive's product failing. \n• There was vandalism done to the wiring behind Aarons which cost us $48k, but we successfully received a check for $43k from our insurance company.",
    "occupancy_rate": "98.58%",
    "market_psf_rate": "$9-10",
    "avg_psf_rate": "$5.29 + $1.84",
    "leasing_strategy": "Fill the remaining small shop space. We have had a few prospects but we will wait for the right user/price for now",
    "vacancies": "2831 - 2,000",
    "tenant_mix": "Good tenant mix at the center.",
    "renewals": "Shelby County - 6/30/26\nUnclaimed Relics - 4/30/26",
    "risks": "Potential future outparcel",
    "capex_budget": {
      "2024": "$315,149",
      "2025": "$362,054",
      "2026": "$153,400",
      "2027": "$75,000",
      "2030": "$60,000"
    },
    "capex_outlook_summary": "We completed some HVAC repairs and replacements for Ollie's and Aarons. We completed some repave work in 2025 for large potholes around the Tractor Supply.  In 2024 we replaced the roof over Keevado, Esbelle, and Aaron's. All other roofs are in good condition. Budgeted for the parking lot sealcoat in 2026",
    "long_term_items": "The parking lot is massive and not in great shape overall.\nHVAC units over Aaron's and Ollies are older units and should we ever have a new tenant in that space, these units will potentially need to be replaced."
  },
  {
    "property_name": "Mission Hotels",
    "missing_2025_plan": true
  },
  {
    "property_name": "Montgomery",
    "date_acquired": "10/13/2023",
    "original_investment_thesis": "Interest in this project stems from the existing tenants, the very high traffic counts, excellent visibility, and our experience with similar value-add retail deals. The former Virginia College space offers an excellent value-add opportunity, and the buildout can be repurposed for multiple uses. Virginia College spent over $4 million dollars on their space in 2008.  Dollar General opened their store in 2006 and the Store Manager communicated that it’s a top performing location. The remaining small shops offer a strong tenant mix and drive different types of consumers to the Shopping Center. Many of the small shop tenants have been at the center for many years and are committed to it long-term.",
    "owners_intent_10yr": "Execute our leasing strategy to backfill the former VC space, along with some small shop vacancies. We will also explore adding a small out parcel out front. Once our leasing efforts are complete, the property should produce significant cash flow and will be a long-term hold property.",
    "general_notes": "• This center overall has a good tenant mix with multiple restaurants, a salon, restaurants, Dollar General, Security Finance and others.\n• We backfilled two restaurants that left due to bankruptcy. MK Wings and 48 Flavors are set to open in Q1 2026.\n• The lanterns/exterior lights are quite outdated. The parking lot lights were all coverted to LED. \n• We replaced the small shop roofs in 2024, and then the VC and DG roof in 2025.\n• Beauty & Beyond has taken possession of their space and begin paying rent in March and plan to be open in May. O'Reilly has finished their buildout and is open for business.\n• There is hope that we will be able to do some out parcels in the future, but we will need to renegotiate that in the DG lease.\n• Onin Staffing is now open as well as R&J Tax. \n• DG consultant reached out to do a renewal deal when they expire in 2026 to keep the same rate. This store is undersized compared to their new prototype of around 10k sqft. They have options remaining in their lease and have to give us 90 days notice.",
    "occupancy_rate": "89%",
    "market_psf_rate": "$10-12",
    "avg_psf_rate": "$9.98+ $1.82",
    "leasing_strategy": "Lease remaining vacancies. The increased traffic from O'Reilly and Beauty and Beyond will be great for the center. Lots of local businesses reach out but not many are qualified",
    "vacancies": "9 - 1,500 - The old chiropractor is in good shape.\n15 - 1,500 - Former Tuny, in great shape\n19-21 - 5,100 - Former VHD Furniture\nCT Nails Suite",
    "tenant_mix": "We have a great mixture of tenants including national tenants such as Dollar General and O'Reilly's. We also have restaurants, service, and other smaller retail stores.",
    "renewals": "Confie 4/30/26 - Dollar General 8/31/26 - Threading Hena 10/31/26\nM&E 3/31/26 - Cakeology MTM - Hair Etc 6/30/26 \nProlink 9/30/26 - Kim Cook 8/31/26",
    "risks": "Hair Etc, Kim Cook, M&E, Confie, and Dollar General not renewing in 2026.",
    "capex_budget": {
      "2024": "$364,339",
      "2025": "$2,194,402",
      "2026": "$73,200",
      "2027": "$50,000",
      "2028": "$25,000"
    },
    "capex_outlook_summary": "All the roofs are new and have been replaced. The PL lights are new. The Parking lot is not in great shape overall.",
    "long_term_items": "Repaint the base of light poles and curbs\nReplace Dead Awning lights\nPaint the rear of the center\nRedo the entrance signs\nRestripe whole lot in 1-2 years"
  },
  {
    "property_name": "New Memphis",
    "date_acquired": "2/15/2019",
    "original_investment_thesis": "Our investment thesis was that we were buying a really cool, historic office building in downtown Memphis for 50 or 60 dollars per sf. It was owned by a non-profit and was very mismanaged. Unfortunately, they did not disclose a bunch to us and this deal has been an uphill grind. We believe it will all work out longterm, but we are going to have to put in a lot of effort to make it happen.",
    "owners_intent_10yr": "Our plan for now is to keep getting leases done on the vacancies and to renew every tenant we can. We need to grow the revenue over time. We also have to keep the expenses in check and manage the capital items (mainly the HVAC) as closely as we can. We are negative cash flow on this deal so we will have to keep hustling to do what we can to break even and hopefully get cash flow positive in 2026.",
    "general_notes": "• The New Memphis Building was formerly known as the Emerge Building. We rebranded in 2023 with our new tenant which occupies the former FedEx space on the third floor, New Memphis.\n• We have a mixture of tenants within the building all with different uses of their spaces. Lawyers, photographers, small business offices, church, deli, etc. \n• Through our lawyer we were able to collect from Big River Market in 2025. In 2024, we were able to sign a lease with Kellies Deli and get them open.\n•Barefoot Bride vacated the first-floor retail/office space. This was a big loss of revenue, but it was best to move on from Joelle who was never happy and always complaining.\n•We built out the 3rd floor space in 2019/2020 for an event venue. We ran Emerge Events out of that space on the 3rd floor until the business was shut down by the city. There is an apartment complex across the street called The Lofts that did not like the noise or traffic in the area.\n•We added a BAS system for the HVAC units & system with Trane for $45k in 2024. We also switched service contracts to Trane away from CS3.\n• We have already purchased 6 new HVAC units and have them stored to replace some old ones as they go out. We have utilized 2 of these units so far. \n• Jadarius has vacated his suite, but we got one lead from a tenant who was using one of his small suites.",
    "occupancy_rate": "61.17%",
    "market_psf_rate": "N/A",
    "avg_psf_rate": "$20.08",
    "leasing_strategy": "Lease as many as possible. Move quickly with the small offices and take what people offer (within reason)",
    "vacancies": "Suite - SF\n216/217 - 1,172\n218 - 671\n219 - 685\n230 - 698\n233/234 - 1,493\n302 - 7,115\n404 - 989\n407 - 693 \n410 - 721\n411 - 1,262\n418 - 677",
    "tenant_mix": "The tenant mix is good at the building.",
    "renewals": "First Choice IT 5/31\nKatressa 5/31\nTech Strada 8/31\nTnAchieves 8/31\nEric Baertels-Raymond James 8/31/24\nTom Pittman 10/31/24 -",
    "risks": "Kellie's Deli has proven to struggle, but has shown resilience and seems to have turned things around.",
    "capex_budget": {
      "2024": "$56,289",
      "2025": "$37,700",
      "2026": "$54,500",
      "2027": "$36,000",
      "2029": "$200,000"
    },
    "capex_outlook_summary": "3rd-floor buildout in 2021 ($212,746.80), replaced elevator board in 2023 ($8,218.00), LED lighting upgrade in 2020, and have replaced several HVAC units since we bought the building. The roof was estimated to cost $117,000 for replacement assessed in 2023. The BAS system replacement was replaced for $45,347 for the whole building in 2024.",
    "long_term_items": "3rd-floor demise \nHVAC units as they go out\nThe roof\nInternet infrastructure is cobbled together."
  },
  {
    "property_name": "Parma Heights",
    "date_acquired": "2/13/23",
    "original_investment_thesis": "A buy & hold deal with future upside. We acquired the property at auction for an attractive price point. Parma Heights is a stable, blue-collar suburb of Cleveland that has significant population density and traffic in front of the center. The Big Lots and Harbor Freight sales performance, low rent of Vitcom, and future out-parcel opportunities were all drivers of our interest in the property. There is also a future play with the KeyBank parcel as they need to ground lease parking area from us, and we also have a first right of refusal on purchasing the property.",
    "owners_intent_10yr": "Our intent tracks closely with our original thesis. We're aiming to return a certain amount of capital back to our investors in 2024/25 via a potential refinance. With Cassidy Theatre opening, our next two steps are to finalize the parking agreement with the Key Bank outparcel.",
    "general_notes": "• Overall this center is in good shape and is attractive from a curb appeal standpoint. \n• We recently had the pylon sign refurbished to really make it pop for the road. We also have a drive aisle repaved in front of Vitcom and potholes filled around the center. \n• in 2024, we had the roof replaced over Harbor Freight, buffet, and Don Ramon. \n• The other issue is the plumbing which is very old underneath Cassidy Theatre which is an old cast iron pipe where the bottom has rotted as the Don Ramon and Harbor Freight pipes run down to the main line that leads to Pearl Road. We had to have major repairs done in 2024, and then a pipe liner installed in 2025.\n• We are currently billing Don Ramon for all the water usage at the center due to it all being on the same meter and the previous owner has always done this. \n• There is only one gas bill for the units on top of the Cassidy theatre and the HF expansion area in the back. We have to bill the tenants back for their usage.\n• For the parking lights, there is one bill that is separated out for half of the center, and the other meter is tied with Vitcoms bill which they send us each month.\n• We were able to work out a deal with the bank outparcel to get extra income from leasing the parking spaces to them.\n• Cassidy Theatre doesn't drive traffic to the center; they use this spot for storage and set building primarily.",
    "occupancy_rate": "100.00%",
    "market_psf_rate": "$8-12",
    "avg_psf_rate": "$4.74 + 3.10",
    "vacancies": "N/A",
    "tenant_mix": "CFB, Vitcom, Don Ramon, and Sakura. This is a fairly good decent mix, however, we want to get rid of Vitcom (and maybe Cassidy) as they do not drive any traffic to the center with their online selling focus.",
    "renewals": "None coming up soon.",
    "risks": "CFB and Cassidy Theatres long term success.",
    "capex_budget": {
      "2023": "$49,375",
      "2024": "$262,911",
      "2025": "$397,956",
      "2026": "$290,292",
      "2027": "$195,000",
      "2031": "$200,000",
      "2033": "$250,000"
    },
    "capex_outlook_summary": "There are some consistent plumbing issues at this center, and we will address those repairs as they come up. We also replaced the roof that was leaking horribly over Don Ramon & HF. The Parking lot is older and still has a few more sections that need to be replaced. The roof has some leaking around the facade that will need to be addressed in 2026.",
    "long_term_items": "Build a second pylon sign for the side entrance near Walgreens\nPlumbing underneath Don Ramon and HF\nSwitch parking lot lights to LED\nSplit Harbor Freight gas to a separate meter than the buffet\nOurpacel / ground lease where the ATM is located\nFood truck in excess parking to the left of Vitcom\nRedo the main drive isles of HF and parking spots in front of Vitcom\nPainting the right side of the wall ($6,000)"
  },
  {
    "property_name": "Pea Ridge",
    "date_acquired": "6/27/2018",
    "original_investment_thesis": "We bought this property due to a relationship with Big Lots and them wanting to relocate in the market. The were on the wrong side of town and this was an upgrade for them. We leased them part of the old Kmart box. We thought we would have a hard time leasing the other half of the box and put very little value on it in the underwriting, but we were fortunate to sign up Valley Health. That has made this property a great performer. We were also able to do a build to suit for Human Bean and leased the other outparcel to Guthrie's, who opened in December 2024.",
    "owners_intent_10yr": "Our plan is to hold this asset for now. It is a great cash flow generator and we have a great tenant base here. We are currently working to redevelop the King Liqours/HSB space into a Grocery Outlet.  That would be a huge addition to the center and add a lot of value. We are also working to ground lease an outparcel out in front of Big Lots and Valley Health. That would be a great value add for the center.",
    "general_notes": "•The center is in a great location for the area and is fully occupied at the moment. This center has been a part of this town for a long time and is well known.\n•We backfilled the Big Lots space with a Valley Health expansion. This was a huge win. We also got the Guthries deal done and they are now open and driving lots of traffic.\n•There used to be a grocery store where King Liquor and HSBC are located. We renewed King Spirit with the new owner and raised their rent significantly.\n•Since owning the center we have made significant improvements to the parking lot, parking lot lights, and now the facade. We have also invested a large amount of TI into Valley Health. We will have another $1M owed to VH for TI.\n•This parking lot is very large and we were able to add a coffee shop to the side portion of the lot closest to King Liquor. Human Bean built a drive-through coffee shop here and it has been a great way to drive foot traffic into the center. We also did a major PL repave in 2024 in front of Big Lots and Valley Health.\n•Unfortunately, the roofs here are coated with Momentive or Everest products. We did major inspections and repairs in 2024. They are both in terrible condition. We are planning to replace the VH section that is Momentive for sure, and probably need to plan on doing the Everest portion as well. \n•VH should be completed with their buildout soon and we will owe them $1m of TI. We will then plan to sell that parcel off seperately from the rest of the center.",
    "occupancy_rate": "96%",
    "market_psf_rate": "$10-12",
    "avg_psf_rate": "$8.84+$2.35",
    "leasing_strategy": "Lease Advantage power",
    "vacancies": "Advantage Power - 5,829",
    "tenant_mix": "Valley Health, Dollar Tree, Human Bean, King Cut, Guthries",
    "renewals": "H&R Block 4/30/26 \nCovered Bridge 3/31/26",
    "risks": "Covered Bridge has informed us that he is in need of a large space. He would like to expand if given the opportunity. \nHSBC has always been an issue",
    "capex_budget": {
      "2024": "$283,647",
      "2025": "$344,664",
      "2026": "$1,162,000"
    },
    "capex_outlook_summary": "All roofs have been coated in 2019-2020 and are now in very bad shape due to needing to be replaced back in 2020. We have addressed the main areas of concern for the parking lot lot in 2024. We completed the facade project in 2024 by replacing the awning and painting the facade.",
    "long_term_items": "Coated roofs\nCoal Tar Pitch smell Valley Health\nParking Lot light issues\nPotential sell of the VH parcel"
  },
  {
    "property_name": "Pell City",
    "date_acquired": "10/18/2016",
    "original_investment_thesis": "This deal was distressed due to Kmart blowing out of it. We bought it due to the low basis and the fact that the price per pound was good. We had bought other Kmarts around this price and knew we could be successful at this basis. Tractor Supply was interested in the box and we knew we could find a discounter. We leased the Kmart to TSC, Bargain Hunt and Martin's. This center has proven to be a great asset for us and Pell City has proven to be a great market. Winn Dixie shut down their store, but we got a great operator when Gerry D bought the location. He has proven to be a great tenant and operator",
    "owners_intent_10yr": "We have a low interest rate CMBS loan on the property for 5 or 6 more years so we do not have any intent to sell right now.  This asset is a great cash flow producer and the investors like the coupon. Like any deal, we would sell it for the right price, but it would have to be an above market offer.",
    "general_notes": "•Property has a great tenant mix and one vacancy (Benders suite). We were able to backfill Bargain Hunt with Vapor Thrift, which was a huge win.\n•Fresh Value owes us a percentage of their sales each year which is great for cash flow as they do really well here and almost always hit their overage amount.\n•The majority of the tenants are billed substantially more than our operating expenses at this property. \n• Mama Spice completed their buildout.\n• We have had issues with the roofs at this shopping center. Some of them are coated with Momentive product (Potential big issue on the horizon) and the we replaced the old ballasted roofs this year with Durolast.",
    "occupancy_rate": "94.22%",
    "market_psf_rate": "$9-11",
    "avg_psf_rate": "$6.22 + $1.40",
    "leasing_strategy": "Lease the gym asap. We have some interest and good tenants \nthat it would make sense to split the box for.",
    "vacancies": "Suite 2 - 9,200",
    "tenant_mix": "Great tenant mix at this center.",
    "renewals": "Pell City Pharmacy - 6/30/26\nT-Mobile 12/31/26\nSecurity Finance 12/31/26",
    "risks": "No real risks at this time.",
    "capex_budget": {
      "2024": "$5,945",
      "2025": "$162,641",
      "2026": "$318,000",
      "2027": "$67,000",
      "2028": "$40,000"
    },
    "capex_outlook_summary": "Potential expensive releasing costs for benders space with TI, Commissions, and maybe splitting the box. Keeping an eye on Momentive roofs and having annual maintenance done.\nWe are planning to do some sealcoating to improve the appearance and to extend the life of the parking lot. \nThe metal roof is in bad shape that overhangs according to Bryan. We will need to plan to have that replaced at some point in the future. He did repairs while they were out there.",
    "long_term_items": "Momentive Roofs"
  },
  {
    "property_name": "Russellville",
    "date_acquired": "3/5/2024",
    "original_investment_thesis": "A low-basis investment with upside via existing vacancy and out parcel opportunities. We acquired the property for a low $24 psf, and there are two strong existing anchors in Tractor Supply and Price Less (Grocery). Their rent basis ensures healthy store performance and/or rent growth if we need to backfill the space. While Russellville is a smaller market, it draws from a larger trade area, and our center is the primary shopping center for the community. Vacancies of 14K and 9K sqft & 3+ out parcel opportunities are the upside.",
    "general_notes": "• Russellville was our sole acquisition in 2024 and is an interesting deal due to the nature of the loan being fully funded.\n• We have a great property inspector/maintenance man Jeremy who really knows the center very well and does maintenance and handyman work.\n• We are excited to have done major repave in 2024 to really increase the overall appearance of the center. This was a big win with tenants and the community.\n• We still need to lease the old furniture store and the suite next to it. We also have been unable to secure an outparcel deal. \n• We successfully replaced the old roofs that were in very bad shape which helped us win goodwill with our tenants.\n• There are still opportunities to do outparcel deals which would really help this deal overall. \n• We were able to successfully renew Liberty Finance, Direct General, and Thomas Tobacco and bumped their rents to get them to market.\n• Unfortunately, Tractor Supply and Priceless have lots of term and options and do not pay good rent. \n• The right side of the center's parking lot is old and faded and needs to be sealcoated.",
    "occupancy_rate": "82.88%",
    "market_psf_rate": "$7-8",
    "avg_psf_rate": "$3.82 + $1.33",
    "leasing_strategy": "Focus on getting 15a leased. We have had one bin store interested, hoping we can move forward with one of them soon. For 15b we have been in talks for a while with ABC store who would pay very good rent.\n\nThere has been some interest on the outparcels, primarily a pharmacy/urgent care.",
    "vacancies": "Suite 3 - 1,416 SF\nSuite 7 - 1,300 SF\nSuite 12 - 2,523\nSuite 15a - 10,114 SF\nSuite 15b - 3,397 SF\nSuite 16 - 771 SF",
    "tenant_mix": "We have a solid tenant mix at this center: Grocery, Tractor Supply, Restaurants, T mobile, and finance stores.",
    "renewals": "New Beginnings - 5/31/26 ($14.88 NNN)\nLiberty Finance - 9/30/26 ($10.30 NNN)\nAarons - 8/31/26 ($4.20 NNN - they have two options remaining)",
    "risks": "Outparcel opportunities that are very important. Valley healthcare is a MTM tenant and their rent could be bumped to market. Liberty Finance renewal - bump to market.",
    "capex_budget": {
      "2024": "$296,122",
      "2025": "$395,961",
      "2026": "$514,340",
      "2027": "$60,304",
      "2028": "$40,000",
      "2034": "$250,000"
    },
    "capex_outlook_summary": "The parking lot is in much better condition now since the repairs in 2025. We will need to sealcoat the right side of the center. We have replaced the bad roofs with new ones. We also have a sloped metal roof on the small building on the right side that has not been replaced that has cause some leaks. HVAC units are older at this center and we have had to replace 3 of them so far. We also had to do $12k in plumbing to old cast iron main in 2025. (Keep an eye out for this)",
    "long_term_items": "HVAC units over time. \nThe plumbing here is old cast iron\nMetal Roof"
  },
  {
    "property_name": "Sevierville",
    "date_acquired": "9/1/2015",
    "original_investment_thesis": "We bought this property due to a motivated seller who was willing to sell it to us at a great price. It was brought to us off market by a broker we had a long relationship with. Kmart was still in the center but they were paying a very low rate. We bought the property with the intent to redevelop the Kmart box once they blew out of the center. They somehow stayed in a business for a few more years than we could have predicted. Once they shut down, we leased the box to Gabe's as they were the only full building user we could find and the TI was minimal. We also knew we would have some outparcel opportunities at the property to create value over time. We sold one to Dutch Bros, which has been a great addition, and we have 1 available in front of Gabe's that we are trying to ground lease.",
    "owners_intent_10yr": "This is a great center in a market where it is very hard to find assets. The center has an amazing cash flow and has a very low interest rate loan until late 2025. Our plan is to keep the asset and provide great cash flow to our investors. We are also focused on finding a great user for the ground lease in front of Gabe's. Our goal for the center is to grow the rents over time.",
    "general_notes": "•Great center that is located in a great part of downtown Sevierville. \n•The former K-Mart we leased to Gabe's. This is a gross lease and they occupy half of the center square footage. They struggled to pay in 2025, and they have had financial issues. We put them in default multiple times. \n•We do not own the entire shopping center. There is a small portion of the very end of the center that is owned by another company.\n•We sold a portion of the parking lot to Dutch Bros in 2022. They opened in early 2023 and have been a great way to bring in foot traffic to the center. They pay us a fixed CAM amount each year but are responsible for their insurance and taxes. \n•Big Lots continued to occupy and operate this store after their bankruptcy and buyout.",
    "occupancy_rate": "100%",
    "market_psf_rate": "$11-13",
    "avg_psf_rate": "$6.72 + $2.22",
    "leasing_strategy": "N/A unless Gabes box or BL box comes back to us if they vacate.",
    "vacancies": "N/A",
    "tenant_mix": "Great tenant mix at this center.",
    "renewals": "Harbor Freight - 8/31/26 ($12.10 NNN - Options remaining)\nBatteries Plus 10/31/26 ($16 NNN)\nRadioShack - 9/30/26 ($18.73 NNN)\nMattresses Inc - 12/26/26 ($13.08 NNN)",
    "risks": "Gabes and Big Lots",
    "capex_budget": {
      "2024": "$5,305",
      "2025": "$2,744",
      "2026": "$157,391",
      "2027": "$113,921",
      "2028": "$532,030",
      "2032": "$177,650"
    },
    "capex_outlook_summary": "The potential risk here is the Everest coated roof. We have not had many issues with this one, but in Pea Ridge we have had some issues with Everest coating.  All other roof replacements were completed in 2016 and 2017. The roof replaced in 2017 has a 10-year warranty that expires in 2027. This is only 10,931 square feet of roof that would need to be replaced.",
    "long_term_items": "The Everest Coated Roof\nTI for Big Lots backfill\nThis property is different than the rest of our centers since Gabe's is a gross lease and the square footage is half of the center. \nAlmost all, besides a select few, of our recoverable expenses are split 50/50 with non-recoverable expenses."
  },
  {
    "property_name": "Shelbyville",
    "date_acquired": "1/18/2018",
    "original_investment_thesis": "We bought this deal due to our relationship with Big Lots. They were an existing tenant at the property but did not have a lot of term left. We need the store did decently well and that they would renew. They renovated the store and we were able to extend their lease. We also knew that we had the room to add an outparcel over time, which we have done with Valvoline, and we still have the small one available behind McDonald's.",
    "owners_intent_10yr": "We had a low interest rate loan on the property through early 2025. Our plan for now is to hold the asset, cash flow it, and continue to pay down the debt. It is a great site in the middle of town and we could upgrade the rents if Big Lots ever went out. They are building a really nice power center behind us which will add value to the center. If we every decided to sell, we would sell the Valvoline ground lease separately as it would bring a much lower cap rate",
    "general_notes": "• We are excited to have Valvoline open. This will drive more traffic and increase cash flow.\n• During their buildout, Valvoline repaved the whole drive aisle on their side of the parking lot.\n• The Big Lots roof was inspected this in 2024 and appears to be in fairly good shape. We are expecting to have to replace it in 3-5 years. \n• We renewed the Hallmark Portable Buildings on a MTM basis until we are able to find a new tenant to do a ground lease on that land. \n• We are actively listing and trying to lease the Big Lots space to a new tenant.",
    "occupancy_rate": "0%",
    "market_psf_rate": "$12-15",
    "avg_psf_rate": "$5.50 + $1.16*",
    "leasing_strategy": "The strategy is to keep marketing the BL box to car dealerships, other retailers, etc. Hopefully doing direct reach outs will help.",
    "vacancies": "Big Lots - 40,000",
    "tenant_mix": "We have the Valvoline outparcel and the Hallmark Portable buildings.",
    "renewals": "N/A",
    "risks": "N/A - Just need to get the BL box leased",
    "capex_budget": {
      "2024": "$4,128",
      "2026": "$190,000"
    },
    "capex_outlook_summary": "We are planning for a potential roof replacement in the next couple of years. \nThe HVAC units at Big Lots also may need some repairs or replacement as we find a new tenant. \nCommissions and TI need to be budgeted for 2026 for Big Lots",
    "long_term_items": "Potential Roof Replacement in 2026 $175,000"
  },
  {
    "property_name": "Trousdale",
    "date_acquired": "5/1/2015",
    "original_investment_thesis": "We bought this property at a very fair cap rate and we thought the rents were below market. That has proven to be true and we have been able to raise the rents over time. This has proven to be a great asset for us and a good long term hold.",
    "owners_intent_10yr": "Our plan is to keep this asset as good real estate in Nashville is very hard to find. It pays a nice coupon to our investors and we contine to pay down the debt. We will keep raising rents on legacy tenants as we are able to get them closer to market rents.",
    "general_notes": "• The center is fully occupied currently with a great tenant mix. \n• All HVAC units (except for Apple Spices 4 units) were stolen in 2022 and replaced. An insurance claim was filed. Due to this issue, we ensured other security measures were put into place such as LED upgrades, flood lights, cameras, and cages on HVAC units.\n• The insurance covered the cost of the units in full but did not cover the cages.\n• We have had issues with the roof above Spruce Music, and we are planning to replace that one in 2026. They have also been complaints from Barber Cabinet on the sounds that come from the pianos in Spruce. \n• FRWD would like to expand if possible in the future and take more space. \n• Three Jaks (Box Drop) sold his business to one of the guys who ran his store for him, Noah Smith, and they moved into the former Seven Six space. \n• All Tenants pay true additional rent: CAM, Taxes, Insurance",
    "occupancy_rate": "100%",
    "market_psf_rate": "$15-19",
    "avg_psf_rate": "$14.75 + $5.16",
    "vacancies": "N/A",
    "tenant_mix": "Pretty good tenant mix, except Apple Spice and One Iron. We are not really sure how they utilize their space. I don't know if it really matters on driving traffic to this property or not.",
    "renewals": "FRWD 3/31/26 ($13.52 NNN)\nMosquito Joe 12/31/26 ($16.76 NNN)",
    "risks": "FRWD Construction has mentioned that they are already outgrowing their current space that they are in. If we had a larger space here they would like to move into that space.",
    "capex_budget": {
      "2023": "$91,996",
      "2024": "$51,296",
      "2025": "$6,745",
      "2026": "$130,500",
      "2027": "$10,000",
      "2028": "$15,000"
    },
    "capex_outlook_summary": "Cages for HVAC units cost us $13,450.00. We also had to do retention pond work in 2023.\nThe roof needs to be replaced in 2026.",
    "long_term_items": "The biggest long-term item to track is security in this area. Very industrial areas and surrounding businesses have been broken into or had things stolen. We are now in a good place right now with the current security measures in place but just something to keep in mind. \nThe roof replacement"
  },
  {
    "property_name": "Vann",
    "date_acquired": "5/15/2015",
    "original_investment_thesis": "We bought this center due to the seller going through a divorce and being willing to sell it at a reasonable cap rate and price per foot.  It was brought to us off market by a broker.  We felt good that we could fill the center up over time and replace struggling tenants.  It has proven to be a decent deal over time and a stable investment for our investors.",
    "owners_intent_10yr": "We have a very low CDFI loan on the property through 2025 so this project is a good cash flow asset for our investors. If we chose to sell it in the current environment, we would not do as well as we should in another market cycle. Our plan is to keep the property leased (it is currently at 100%), pay down the debt and provide a good coupon to our investors.",
    "general_notes": "•Overall center operates well and is now fully occupied. We are planning to sell this property in 2026 and began by hiring a broker in 2025. \n•In 2023 we lowered the budget for tenants. Found room to save money. Decreased to $5.51 per sqft. \n•In 2022 we signed a lease with Nails Paradise who took over half of the former Catherine's space and in 2023 we signed a lease with Replay Toys who took over the remaining portion. \n•The roof over this center is a Momentive coating. We have not had issues with it, but it is worth noting and doing annual inspections on.\n•We did a one year renewal with Bo Rucker and let him know when his next renewal comes up there will be a BIG increase, so he can begin looking at other places or budget to have much higher rent payments.\n•We had a legal battle with a neighboring owner within the REA about paving billing and ended up having to pay $11,820 back to them.",
    "occupancy_rate": "100%",
    "market_psf_rate": "$22-27",
    "avg_psf_rate": "$14.43 + $5.96",
    "vacancies": "N/A",
    "tenant_mix": "Overall good mix of tenants at the shopping and no need to change who we currently have in the center.",
    "renewals": "- Maggie Moos 10/31/26 ($17.63NNN - They have options)\n- Newbury St 12/31/26 ($14NNN)",
    "risks": "Newbury St and Replay Toys could both be vacating in 2026.",
    "capex_budget": {
      "2024": "$27,710",
      "2025": "$13,490",
      "2026": "$110,320",
      "2027": "$60,000",
      "2029": "$170,000"
    },
    "capex_outlook_summary": "In 2021 paving work was done with other owners of the shopping center. It was split between owners since some portions of the paving overlapped and benefited all parts of this portion of the center and the total cost was around $90k. Roof coating (Momentive) was completed over the entire portion of the shopping center that we own in 2020. We have some old HVACs that could be a big cost in the future. All of Uniform Sources are older and it is our responsibility.",
    "long_term_items": "The center gets a lot of traffic and it is shown in the parking lot. This is a high-traffic shopping center and one of the main entrances is right by our portion of the center. \nHVAC units and retenanting costs."
  },
  {
    "property_name": "Wilson",
    "date_acquired": "9/30/2014",
    "original_investment_thesis": "We bought this property due to it being a very low price for a site in the middle of Brentwood. It was basically a junk yard when we bought it. We cleaned it up and built a new building for Crossfit Trivium. This has proven to be a great investment in a market that is very hard to get into.",
    "owners_intent_10yr": "We are in the process of trying to decide what we want to do with the Accent Flowers building. The building is in bad shape and we will eventually need to redevelop it.  We will need to make the decision by mid year if we are going to start the process or renew the tenants for another year and wait. Our plan is to hold this property long term. It is nearly impossible to find great sites in Brentwood at a reasonable basis and we have no intention of selling",
    "general_notes": "• We have two vacant spaces - Accent space and the Barbershop. We have two MTM tenants in Ed's and Ann's Framing.\n• The main building is old and not in great shape. Both Anns and Ed's want to stay at the building, and we have to give Ed 90 day notice, and he also have to give us that same notice.\n• We have worked with FRWD to get numbers on what it would cost to redevelop and it is very expensive. More than we are wanting to spend.\n• We were able to successfully renew Crossfit, both their offices and the gym, for 5 years. This deal was first 3 years flat and the last 2 years at a 2% increase. We also gave them TI money to rennovate and improve their suites. \n• There was a cracked concrete in the drive aisle where a utility line was installed and we did that paving work in 2025.\n• Accent flowers HVAC unit is old and needs to be replaced when we find a new tenant which will cost us about $13,480.\n• We have had major water issues with flooding in Accent flowers and Kennys - however, we made major strides in 2025 and installed a taller curb and rerouted gutters to push water away from the building. \n• Due to there not being heat in the greenhouse of Accent, we have dealt with a broken water pipe in that suite in 2024 and 2025.",
    "occupancy_rate": "70.21%",
    "market_psf_rate": "$27-33",
    "avg_psf_rate": "$17.56",
    "leasing_strategy": "We have tried to find a service industry type user that would take the whole main building as their HQ.",
    "vacancies": "-400 sf of vacant space that used to be The Brentwood Barber Shop\n-4,900 sf Accent Flowers",
    "tenant_mix": "Flower Shop, Eds, and Crossfit gym. Mixed use.",
    "renewals": "- Ann's Framing: MTM\n- Ed's 4x4: MTM (90 day notice)",
    "risks": "We are at risk of losing Ed's and Anns due to them being a MTM lease, however, we don't see them ever wanting to leave. They both love the location.",
    "capex_budget": {
      "2025": "$59,724",
      "2026": "$2,281,500"
    },
    "capex_outlook_summary": "Parking lot is in pretty good shape after we completed repairs in 2025.\nHVAC issues with accent flowers space that will need to be replaced in 2026.\nThe main building is old and is going to need some TI - There is mold and water damage from the flooding over the years.",
    "long_term_items": "Potentially demo the main building and develop a new one.\nPotentially fix the flooring and grading outside at Accent Flowers where there was flooding in 2021. (After an inspection on 03/23 it looks fine)\nAnnual gutter cleaning and outdoor drain cleanout beside the accent flowers to prevent flooding"
  }
]